# Target Guided Ordinal Encoding

It is a technique used to encode categorical variables based on the relationship between the categories and the target variable. In this method, the categories are ordered based on their mean (or median) target value, and then assigned ordinal values accordingly. This approach is particularly useful when there is a strong correlation between the categorical variable and the target variable.

In [1]:
import pandas as pd

In [7]:
# Create a sample dataframe with categorical variable and target variable
df = pd.DataFrame ({
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia'],
    'price': [700000, 650000, 600000, 550000, 500000, 450000]
})

In [8]:
df

           city   price
0      New York  700000
1   Los Angeles  650000
2       Chicago  600000
3       Houston  550000
4       Phoenix  500000
5  Philadelphia  450000

In [11]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [12]:
mean_price

{'Chicago': 600000.0,
 'Houston': 550000.0,
 'Los Angeles': 650000.0,
 'New York': 700000.0,
 'Philadelphia': 450000.0,
 'Phoenix': 500000.0}

In [13]:
df['city_encoded'] = df['city'].map(mean_price)

In [14]:
df

           city   price  city_encoded
0      New York  700000      700000.0
1   Los Angeles  650000      650000.0
2       Chicago  600000      600000.0
3       Houston  550000      550000.0
4       Phoenix  500000      500000.0
5  Philadelphia  450000      450000.0

In [15]:
df[['price', 'city_encoded']]

    price  city_encoded
0  700000      700000.0
1  650000      650000.0
2  600000      600000.0
3  550000      550000.0
4  500000      500000.0
5  450000      450000.0